Revit 2027 API
ScheduleDefinition.FamilyId Property
 In a note block schedule, the ID of the Generic Annotation family displayed by the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId FamilyId { get; }
Public ReadOnly Property FamilyId As ElementId
	Get
public:
property ElementId^ FamilyId {
	ElementId^ get ();
}
member FamilyId : ElementId with get
Property Value
ElementId
Remarks
 A note block is a schedule of the Generic Annotations category that shows elements of a single family rather than all elements in the category.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace